backend/app/controllers/playlists_controller.rb

  def index
    playlists = Playlist.all
---
SELECT "playlists".* FROM "playlists"

  def create
    if @playlist.user != current_user
      render json: { msg: "Please login to create playlist" }
    else
      @playlist.create(playlist_params)
---
INSERT INTO "playlists" ("user_id", "name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "avc"], ["description", "abc"], ["created_at", "2021-01-08 13:28:39.525837"], ["updated_at", "2021-01-08 13:28:39.525837"]]

  def show
    playlist = Playlist.find_by(id: params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]