backend/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "dbrisco10"], ["LIMIT", 1]]
---
    def create
        @user = User.find_by(username: user_params[:username])