backend/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.valid?
      @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)